bedV01ErgunRealSizeBed/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 	0 	0.0)		// 0
    (0.086 	0 	0.0)		// 1
    (0.086 	0.4  	0.0)		// 2
    (0 	0.4 	0.0)		// 3
    (0 	0 	0.1)		// 4
    (0.086 	0 	0.1)	// 5
    (0.086 	0.4 	0.1)	// 6
    (0 	0.4   	0.1)		// 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (80 100 1) simpleGrading (1 1 1)
);

defaultPatch
{
    type empty;
}

boundary
(  
   
    bottom
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }

    walls
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (2 6 5 1)
        );
    }

    sym
    {
        type symmetry;
        faces
        (
            (0 4 7 3)
        );
    }
);


// ************************************************************************* //
