bedV01ErgunRealSizeBed/0/alpha.air.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      alpha.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    inletAir
    {
        type            inletOutlet;
        phi             phi.air;
        inletValue      uniform 0.6;
        value           uniform 0.6;
    }
    
    inletWater
    {
        type            fixedValue;
        value           uniform 0;
    }
    
    bottom
    {
        type            zeroGradient;
    }
    
    sym
    {
    	type		symmetry;
    }
    
    walls
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
