bedV01ErgunRealSizeBed/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    inletWater;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (-0.001 0.3999 -0.2) (0.0065 0.4001 0.2);
    }

    {
        name    inletWater;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        set     inletWater;
    }
    
    {
        name    inletAir;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (0.00651 0.39999 -0.2) (0.1 0.4001 0.2);
    }

    {
        name    inletAir;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        set     inletAir;
    }

);

// ************************************************************************* //
